---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ReferencesOutsideGroupAreNotAllowed
source: html/f8842410-06cc-cdfe-323f-7a8a9585cb4a.htm
---
# Autodesk.Revit.DB.BuiltInFailures.GroupFailures.ReferencesOutsideGroupAreNotAllowed Property

The elements you have selected for grouping contain dimensions or tags whose references are not all included in the selection being
 grouped and are not all included in a common model group.
 As a result, some of the selected elements have not been included in the new group.

## Syntax (C#)
```csharp
public static FailureDefinitionId ReferencesOutsideGroupAreNotAllowed { get; }
```